 
& acos()
 
  Syntax: acos(<number>)
 
  This function returns the arc-cosine of <number>, expressed in
  radians.
 
  Example:
 
  > say acos(0)
  You say "1.570796"
  > say acos(1)
  You say "0"
  > say acos(0.707101)
  You say "0.785406"
  > say acos(0.866025)
  You say "0.5236"
 
  See also: asin(), atan(), cos(), pi(), sin(), tan().
 