 
& gte()
 
  Syntax: gte(<integer1>,<integer2>)
 
  Takes two integers, and returns 1 if and only if <integer1> is
  greater than or equal to <integer2>, and 0 otherwise.
   
  Warning: Passing anything but integers will produce unexpected
  results, as non-numeric strings usually are treated as numeric 0.
 
  Example:
 
  > say gte(4,5)
  You say "0"
  > say gte(5,5)
  You say "1"
  > say gte(6,5)
  You say "1"
  > say gte(foo, bar)
  You say "1"
 
  See Also: lt(), lte(), gt(), eq(), neq()
 