 
& ln()
 
  Syntax: ln(<number>)
 
  Returns the result of taking the natural logarithm (base e) of
  <number>. <number> may be a floating point number, and a floating
  point result is returned.
 
  Example:
 
  > say ln(0)
  You say "#-1 LN OF NEGATIVE OR ZERO"
  > say ln(1)
  You say "0"
  > say ln(e())
  You say "1"
  > say ln(10)
  You say "2.302585"
 
  See Also: e(), exp(), log(), power()
 