 
& log()
 
  Syntax: log(<number>)
 
  Returns the result of taking the common logarithm (base 10) of
  <number>. <number> may be a floating point number, and a floating
  point result is returned.
 
  Example:
 
  > say log(0)
  You say "#-1 LOG OF NEGATIVE OR ZERO"
  > say log(1)
  You say "0"
  > say log(10)
  You say "1"
  > say log(e())
  You say "0.434294"
 
  See Also: e(), exp(), ln(), power()
 