 
& lt()
 
  Syntax: lt(<integer1>,<integer2>)
 
  Takes two integers, and returns 1 if and only if <integer1> is less
  than <integer2>, and 0 otherwise.
 
  Warning: Passing anything but integers will produce unexpected
  results, as non-numeric strings are usually treated as numeric 0.
 
  Example:
 
  > say lt(4,5)
  You say "1"
  > say lt(5,5)
  You say "0"
  > say lt(6,5)
  You say "0"
  > say lt(foo, bar)
  You say "0"
 
  See Also: lte(), gte(), gt(), eq(), neq()
 