 
& parent()
 
  Syntax: parent(<obj>)
 
  Returns the parent of <obj>. Returns #-1 if <obj> cannot be found or
  if you do not own <obj> and it is not set VISUAL.
 
  Example:
 
  > say parent(me)
  You say "#-1"
  > say My va is [v(va)].
  You say "My va is "
  > @parent me=test
  Parent set.
  > say parent(me)
  You say "#323"
  > say My va is [v(va)].
  You say "My va is Testing 123"
 
  See Also: children(), @parent, PARENT OBJECTS
 