 
& round()
 
  Syntax: round(<number>,<places>)
 
  Rounds <number> to <places> decimal places. <number> may be a
  floating point number, and an integer result is returned.
 
  Example:
 
  > say round(5,0)
  You say "5"
  > say round(5.123,1)
  You say "5.1"
  > say round(9.8765,3)
  You say "9.877"
  > say round(5.5,0)
  You say "6"
  > say round(-5.5,0)
  You say "-6"
 
  See Also: div(), floor(), mod(), trunc()
 