 
& asin()
 
  Syntax: asin(<number>)
 
  Returns the arcsine of <number>, expressed in radians.
 
  Example:
 
  > say asin(0)
  You say "0"
  > say asin(1)
  You say "1.570796"
  > say asin(0.707101)
  You say "0.78539"
  > say asin(0.5)
  You say "0.523599"
 
  See Also: acos(), atan(), cos(), pi(), sin(), tan().
 