 
& ceil()
 
  Syntax: ceil(<number>)
 
  Returns the smallest integer greater than or equal to <number>.
  <number> may be a floating point number, and an integer result is
  returned.
 
  Examples:
 
  > say ceil(5)
  You say "5"
  > say ceil(5.2)
  You say "6"
  > say ceil(5.8)
  You say "6"
  > say ceil(-5)
  You say "-5"
  > say ceil(-5.2)
  You say "-5"
 
  See Also: div(), floor(), mod(), round(), trunc().
 