 
& cos()

  Syntax: cos(<number>)

  Returns the cosine of <number>, expressed in radians.

  Examples:

  > say cos(0)
  You say "1"
  > say cos(fdiv(pi(),2))
  You say "0"
  > say cos(fdiv(pi(),4))
  You say "0.707107"
  > say cos(fdiv(pi(),6))
  You say "0.866025"
  
  See Also: acos(), asin(), atan(), pi(), sin(), tan().
 