 
& idle()
 
  Syntax: idle(<player>)
 
  Returns the number of seconds that <player> has been idle. If
  <player> is not connected then -1 is returned. If <player> is
  connected more than once, the smallest idle time is returned.
 
  Example:
 
  > WHO
  Player Name          On For Idle  Doing
  Wizard                00:04   1m
  Mortal                00:11   0s 
  Evinar                00:12   6m 
  frobozz               00:32   6s 
  4 Players logged in.
  > say idle(wiz)
  You say "6"
  > say idle(e)
  You say "371"
  > say idle(frobozz)
  You say "-1"
 
  See Also: WHO, conn(), lwho()
 