 
& iter()
 
  Syntax: iter(<list>, <eval>[, <delim>])
 
  <list> is a <delimter>-separated list of strings, which can be
  object numbers, attributes, or arbitrary words. <eval> is a string
  that is to be evaluated once for each item in <list>, replacing the
  special symbol ## with the corresponding item from <list>, and the
  symbol #@ with the position within the list being iterated. A space
  separated list of the results of these evaluations is returned to
  the caller.
 
  The effect is very similar to @dolist, except that the results are
  made into a list and returned, not executed.
 
  Example:
 
  > say iter(This is a test,strlen(##))
  You say "4 2 1 4"
  > say iter(This is a test,{strlen(##)})
  You say "4 2 1 4"
  > say iter(lnum(10),mul(mul(##,##),10))
  You say "0 10 40 90 160 250 360 490 640 810"
  > say iter(lcon(me),[name(##)]..[money(##)])
  You say "test..1 t1..1 radio..1 The Wizard's Pointy Hat..1"
  > say iter(Was it a cat I saw,[words(##)] #@,s)
  You say "1 1 4 2 1 3"
 
  See Also: @dolist, list(), parse()
 