 
& lattr()
 
  Syntax: lattr(<object>[/<wild-pattern>])
 
  Returns a list of the attributes set on <object>. If <wild-pattern>
  is given, only attributes matching it are returned.
 
  Example:
 
  > ex me
  Mortal(#226Pc)
  ....
  VC:Mon Sep  9 12:09:01 1991
  VE:baz
  Last:Thu Dec 19 08:57:21 1991
  VV(#2+):Foof!
  Domain:Abusees
  ....
  > say lattr(me)
  You say "Desc VC VE Last VV Domain"
  > say lattr(me/v*)
  You say "VC VE VV"
 
  See Also: hasattr(), get(), u()
 