 
& rand()
 
  Syntax: rand(<num>)
 
  Rand returns an integer between 0 and num-1.
 
  Example:
 
  > say rand(10)
  You say "6"
  > say rand(10)
  You say "1"
  > say rand(10)
  You say "4"
  > say rand(10)
  You say "9"
  > say rand(10)
  You say "1"
 