 
& sqrt()
 
  Syntax: sqrt(<number>)
 
  Returns the square root of <number>. <number> may be a floating
  point number, and a floating point result is returned. <number> may
  not be negative.
 
  Example:
  > say sqrt(2)
  You say "1.414214"
  > say sqrt(100)
  You say "10"
  > say sqrt(0)
  You say "0"
  > say sqrt(-1)
  You say "#-1 SQUARE ROOT OF NEGATIVE"
 
  See Also: power()
 